app/views/houses/show.html.erb

<div class="row">
  <h3>Displaying housing data for <%= @house.profile.firstname %></h3>
---
SELECT  `profiles`.* FROM `profiles` WHERE `profiles`.`id` = 1 LIMIT 1