app/controllers/expenses_controller.rb

UPDATE `expenses` SET `clothing` = 200, `healthcare` = 100, `vehicle` = 150, `home_maintenance` = 300, `updated_at` = '2016-02-17 22:36:18' WHERE `expenses`.`id` = 1
---
  def update
    respond_to do |format|
      if @expense.update(expense_params)

SELECT  `expenses`.* FROM `expenses` WHERE `expenses`.`profile_id` = 1 LIMIT 1
---
    def set_expense
      @expense = Expense.find_by profile_id: params[:profile_id]

SELECT  `profiles`.* FROM `profiles` WHERE `profiles`.`id` = 1 LIMIT 1
---
    def set_profile
      @profile = Profile.find(params[:profile_id])