app/controllers/houses_controller.rb

  def update
    respond_to do |format|
      if @house.update(house_params)
---
UPDATE `houses` SET `electricity` = 100, `fuel` = 50, `gas` = 50, `water` = 200, `updated_at` = '2016-02-17 22:32:01' WHERE `houses`.`id` = 1

    def set_profile
      @profile = Profile.find(params[:profile_id])
---
SELECT  `profiles`.* FROM `profiles` WHERE `profiles`.`id` = 1 LIMIT 1