app/controllers/profiles_controller.rb

  def create
    @profile = Profile.new(profile_params)
    respond_to do |format|
      if @profile.save
---
INSERT INTO `profiles` (`firstname`, `lastname`, `age`, `country`, `state`, `city`, `zipcode`, `created_at`, `updated_at`) VALUES ('Torleif', 'Nielsen', 22, 'US', 'HI', 'Honolulu', 96822, '2016-01-27 04:46:33', '2016-01-27 04:46:33')

  def destroy
    @profile.destroy
---
DELETE FROM `profiles` WHERE `profiles`.`id` = 1