app/views/expenses/show.html.erb

SELECT  `profiles`.* FROM `profiles` WHERE `profiles`.`id` = 1 LIMIT 1
---
  <h3>Displaying expense data for <%= @expense.profile.firstname %></h3>